eCollection_MISIntimation_API_AMS319_intimation/devops/stub-sample-messages/v3.9-configrity/sample-soap-request-with-xml-signature-2.xml

<soap11:Envelope xmlns:soap11="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<soap11:Header>
		<NS1:Security
			xmlns:NS1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<NS1:BinarySecurityToken
				xmlns:NS2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
				NS2:EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#Base64Binary"
				NS2:Id="IXC_ACME_PubKey"
				NS2:ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3">MIIBuDCCASwGByqGSM44BAEwggEfAoGBAP1/U4EddRIpUt9KnC7s5Of2EbdSPO9EAMMeP4C2USZpRV1AIlH7WT2NWPq/xfW6MPbLm1Vs14E7gB00b/JmYLdrmVClpJ+f6AR7ECLCT7up1/63xhv4O1fnxqimFQ8E+4P208UewwI1VBNaFpEy9nXzrith1yrv8iIDGZ3RSAHHAhUAl2BQjxUjC8yykrmCouuEC/BYHPUCgYEA9+GghdabPd7LvKtcNrhXuXmUr7v6OuqC+VdMCz0HgmdRWVeOutRZT+ZxBxCBgLRJFnEj6EwoFhO3zwkyjMim4TwWeotUfI0o4KOuHiuzpnWRbqN/C/ohNWLx+2J6ASQ7zKTxvqhRkImog9/hWuWfBpKLZl6Ae1UlZAFMO/7PSSoDgYUAAoGBAOWF4I9YM1gTMlviJyJV5c5JvnCznWFHPsqLgy9/V9Dam4aUE5udKwre9pX63vofkRJ98S55whcFpHSBoD2ULm40RRte3HikdZkLX8B4Y4Co0OimqGadu/ByUJ8BzermPB3UK831CoPujSTLa/5X+E2OQuqLWQorrVFF5AB8pyXG
			</NS1:BinarySecurityToken>
			<NS3:Signature xmlns:NS3="http://www.w3.org/2000/09/xmldsig#">
				<NS3:SignedInfo>
					<NS3:CanonicalizationMethod
						Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#WithComments" />
					<NS3:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#dsa-sha1" />
					<NS3:Reference>
						<NS3:Transforms>
							<NS3:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#base64">
								<NS4:Selection xmlns:NS4="http://www.w3.org/2010/xmldsig2#"
									Algorithm="http://www.w3.org/2010/xmldsig2#xml" URI="Sign-8962c1de-f991-4e90-9cdd-5ab294fb9b07" />
							</NS3:Transform>
						</NS3:Transforms>
						<NS3:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<NS3:DigestValue>a77b77a96b043aa9dc4292c600c3ea6373d4793b
						</NS3:DigestValue>
					</NS3:Reference>
				</NS3:SignedInfo>
				<NS3:SignatureValue>302d02141cdca330515ce62d1004575ec4ef53e7ae3661c3021500948771986d79e74cddb7749242c5da627d43307a
				</NS3:SignatureValue>
				<NS3:KeyInfo>
					<NS3:KeyValue>
						<NS1:SecurityTokenReference>
							<NS1:Reference URI="IXC_ACME_PubKey" />
						</NS1:SecurityTokenReference>
					</NS3:KeyValue>
				</NS3:KeyInfo>
			</NS3:Signature>
		</NS1:Security>
	</soap11:Header>
	<soap11:Body>
		<clientNS:intimation_request
			xmlns:NS5="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			xmlns:clientNS="http://www.icicibank.com/api/acme" NS5:Id="Sign-8962c1de-f991-4e90-9cdd-5ab294fb9b07">
			<clientNS:api_version>1.2.0</clientNS:api_version>
			<clientNS:request_id>9708C6C0-A2D0-4684-906D-69013AF411BF
			</clientNS:request_id>
			<clientNS:request_datetime>2020-08-04T00:00:53.606+05:30
			</clientNS:request_datetime>
			<clientNS:sender_system_id>Profunds</clientNS:sender_system_id>
			<clientNS:sender_system_user_id>raman.kumar@icicibank.com
			</clientNS:sender_system_user_id>
			<clientNS:request_priority>3</clientNS:request_priority>
			<clientNS:test_indicator>false</clientNS:test_indicator>
			<clientNS:client_code>ACME</clientNS:client_code>
			<clientNS:virtual_account_number>ADANX031192399
			</clientNS:virtual_account_number>
			<clientNS:transaction_amount>2.88E+4</clientNS:transaction_amount>
			<clientNS:currency_code>INR</clientNS:currency_code>
			<clientNS:payment_mode>NEFT</clientNS:payment_mode>
			<clientNS:transaction_id>202008041</clientNS:transaction_id>
			<clientNS:transaction_id_type>UTR</clientNS:transaction_id_type>
			<clientNS:transaction_datetime>2020-08-03T23:55:43.609
			</clientNS:transaction_datetime>
			<clientNS:sender_name>Tryion Lannister</clientNS:sender_name>
			<clientNS:sender_mobile_communication_number>9880001010
			</clientNS:sender_mobile_communication_number>
			<clientNS:sender_account_number>0710107844276
			</clientNS:sender_account_number>
			<clientNS:sender_bank_name>SBI</clientNS:sender_bank_name>
			<clientNS:sender_ifsc_code>SBIN0000710</clientNS:sender_ifsc_code>
			<clientNS:client_account_name>Adani Petrochemicals
			</clientNS:client_account_name>
			<clientNS:client_mobile_communication_number>9880001010
			</clientNS:client_mobile_communication_number>
			<clientNS:client_account_number>0081202280775
			</clientNS:client_account_number>
			<clientNS:client_bank_name>ICICI</clientNS:client_bank_name>
			<clientNS:client_ifsc_code>ICIC0000008</clientNS:client_ifsc_code>
			<clientNS:narration_1>Narration 1</clientNS:narration_1>
			<clientNS:narration_2>Narration 2</clientNS:narration_2>
			<clientNS:informational_message>A quick brown fox jumped over the
				lazy dog !</clientNS:informational_message>
		</clientNS:intimation_request>
	</soap11:Body>
</soap11:Envelope>